//
//  Localizable.strings
//  Stats
//
//  Created by Serhiy Mytrovtsiy on 27/08/2020.
//  Using Swift 5.0.
//  Running on macOS 10.15.
//
//  Copyright © 2020 Serhiy Mytrovtsiy. All rights reserved.
//

// Modules
"CPU" = "CPU";
"Open CPU settings" = "Mở cài đặt CPU";
"GPU" = "GPU";
"Open GPU settings" = "Mở cài đặt GPU";
"RAM" = "RAM";
"Open RAM settings" = "Mở cài đặt RAM";
"Disk" = "Ổ đĩa";
"Open Disk settings" = "Mở cài đặt ổ đĩa";
"Sensors" = "Cảm biến";
"Open Sensors settings" = "Mở cài đặt cảm biến";
"Network" = "Mạng";
"Open Network settings" = "Mở cài đặt mạng";
"Battery" = "Pin";
"Open Battery settings" = "Mở cài đặt Pin";
"Bluetooth" = "Bluetooth";
"Open Bluetooth settings" = "Mở cài đặt Bluetooth";
"Clock" = "Đồng hồ";
"Open Clock settings" = "Mở cài đặt đồng hồ";

// Words
"Unknown" = "Không xác định";
"Version" = "Phiên bản";
"Processor" = "Bộ xử lý";
"Memory" = "Bộ nhớ";
"Graphics" = "Đồ họa";
"Close" = "Đóng";
"Download" = "Tải xuống";
"Install" = "Cài đặt";
"Cancel" = "Hủy";
"Unavailable" = "Không khả dụng";
"Yes" = "Có";
"No" = "Không";
"Automatic" = "Tự động";
"Manual" = "Thủ công";
"None" = "Không có";
"Dots" = "Dấu chấm";
"Arrows" = "Mũi tên";
"Characters" = "Ký tự";
"Short" = "Ngắn";
"Long" = "Dài";
"Statistics" = "Thống kê";
"Max" = "Tối đa";
"Min" = "Tối thiểu";
"Reset" = "Đặt lại";
"Alignment" = "Căn chỉnh";
"Left alignment" = "Căn trái";
"Center alignment" = "Căn giữa";
"Right alignment" = "Căn phải";
"Dashboard" = "Bảng điều khiển";
"Enabled" = "Đã bật";
"Disabled" = "Đã tắt";
"Silent" = "Im lặng";
"Units" = "Đơn vị";
"Fans" = "Quạt";
"Scaling" = "Tỷ lệ";
"Linear" = "Tuyến tính";
"Square" = "Bình phương";
"Cube" = "Lập phương";
"Logarithmic" = "Logarit";
"Fixed scale" = "Tỷ lệ cố định";
"Cores" = "Nhân";
"Settings" = "Cài đặt";
"Name" = "Tên";
"Format" = "Định dạng";
"Turn off" = "Tắt";
"Normal" = "Bình thường";
"Warning" = "Cảnh báo";
"Critical" = "Nguy cấp";
"Usage" = "Sử dụng";
"2 minutes" = "2 phút";
"3 minutes" = "3 phút";
"10 minutes" = "10 phút";
"Import" = "Nhập";
"Export" = "Xuất";
"Separator" = "Phân cách";
"Read" = "Đọc";
"Write" = "Ghi";
"Frequency" = "Tần số";
"Save" = "Lưu";
"Run" = "Chạy";
"Stop" = "Dừng";
"Uninstall" = "Gỡ cài đặt";
"1 sec" = "1 giây";
"2 sec" = "2 giây";
"3 sec" = "3 giây";
"5 sec" = "5 giây";
"10 sec" = "10 giây";
"15 sec" = "15 giây";
"30 sec" = "30 giây";
"60 sec" = "60 giây";

// Setup
"Stats Setup" = "Thiết lập Stats";
"Previous" = "Trước";
"Previous page" = "Trang trước";
"Next" = "Tiếp";
"Next page" = "Trang tiếp theo";
"Finish" = "Hoàn tất";
"Finish setup" = "Hoàn tất thiết lập";
"Welcome to Stats" = "Chào mừng đến với Stats";
"welcome_message" = "Cảm ơn vì đã sử dụng Stats, công cụ giám sát hệ thống macOS miễn phí mã nguồn mở trên thanh menu.";
"Start the application automatically when starting your Mac" = "Tự động khởi động ứng dụng khi bật Mac của bạn";
"Do not start the application automatically when starting your Mac" = "Không tự động khởi động ứng dụng khi bật Mac của bạn";
"Do everything silently in the background (recommended)" = "Thực hiện mọi thứ âm thầm trong nền (khuyến nghị)";
"Check for a new version on startup" = "Kiểm tra phiên bản mới khi khởi động";
"Check for a new version every day (once a day)" = "Kiểm tra phiên bản mới mỗi ngày (một lần một ngày)";
"Check for a new version every week (once a week)" = "Kiểm tra phiên bản mới mỗi tuần (một lần một tuần)";
"Check for a new version every month (once a month)" = "Kiểm tra phiên bản mới mỗi tháng (một lần một tháng)";
"Never check for updates (not recommended)" = "Không bao giờ kiểm tra cập nhật (không khuyến nghị)";
"Anonymous telemetry for better development decisions" = "Dữ liệu ẩn danh để cải thiện quyết định phát triển";
"Share anonymous telemetry data" = "Chia sẻ dữ liệu ẩn danh";
"Do not share anonymous telemetry data" = "Không chia sẻ dữ liệu ẩn danh";
"The configuration is completed" = "Cấu hình đã hoàn tất";
"finish_setup_message" = "Tất cả đã được thiết lập! \n Stats là một công cụ mã nguồn mở miễn phí và sẽ luôn như vậy. \n Nếu bạn yêu thích, hãy ủng hộ dự án, điều đó luôn được đánh giá cao!";

// Alerts
"New version available" = "Có phiên bản mới";
"Click to install the new version of Stats" = "Nhấn để cài đặt phiên bản mới của Stats";
"Successfully updated" = "Cập nhật thành công";
"Stats was updated to v" = "Stats đã được cập nhật lên v%0";
"Reset settings text" = "Tất cả cài đặt ứng dụng sẽ được đặt lại và ứng dụng sẽ khởi động lại. Bạn có chắc chắn muốn thực hiện không?";
"Support text" = "Cảm ơn bạn đã sử dụng Stats!\n\n Việc duy trì và cải thiện dự án nguồn mở này cần có thời gian và nguồn lực. Sự hỗ trợ của bạn giúp chúng tôi tiếp tục cung cấp một ứng dụng miễn phí và đáng tin cậy cho mọi người.\n\nNếu bạn thấy Stats hữu ích, vui lòng cân nhắc đóng góp. Mỗi đóng góp nhỏ đều có ích!";

// Settings
"Open Activity Monitor" = "Mở Activity Monitor";
"Report a bug" = "Báo cáo lỗi";
"Support the application" = "Hỗ trợ ứng dụng";
"Close application" = "Đóng ứng dụng";
"Open application settings" = "Mở cài đặt ứng dụng";
"Open dashboard" = "Mở bảng điều khiển";
"No notifications available in this module" = "Không có thông báo nào trong module này";
"Open Calendar" = "Mở Lịch";
"Toggle the module" = "Bật/tắt module";

// Application settings
"Update application" = "Cập nhật ứng dụng";
"Check for updates" = "Kiểm tra cập nhật";
"At start" = "Khi khởi động";
"Once per day" = "Một lần mỗi ngày";
"Once per week" = "Một lần mỗi tuần";
"Once per month" = "Một lần mỗi tháng";
"Never" = "Không bao giờ";
"Check for update" = "Kiểm tra cập nhật";
"Show icon in dock" = "Hiển thị biểu tượng trong Dock";
"Start at login" = "Khởi động cùng đăng nhập";
"Build number" = "Số bản dựng";
"Import settings" = "Nhập cài đặt";
"Export settings" = "Xuất cài đặt";
"Reset settings" = "Đặt lại cài đặt";
"Pause the Stats" = "Tạm dừng Stats";
"Resume the Stats" = "Tiếp tục Stats";
"Combined modules" = "Các module kết hợp";
"Combined details" = "Chi tiết kết hợp";
"Spacing" = "Khoảng cách";
"Share anonymous telemetry" = "Chia sẻ dữ liệu ẩn danh";
"Choose file" = "Chọn tập tin";
"Stress tests" = "Kiểm tra áp lực";

// Dashboard
"Serial number" = "Số serial";
"Model identifier" = "Mã định danh model";
"Production year" = "Năm sản xuất";
"Uptime" = "Thời gian hoạt động";
"Number of cores" = "%0 nhân";
"Number of threads" = "%0 luồng";
"Number of e-cores" = "%0 nhân tiết kiệm";
"Number of p-cores" = "%0 nhân hiệu năng";
"Disks" = "Ổ cứng"; // translategemma:4b
"Display" = "Hiển thị"; // translategemma:4b

// Update
"The latest version of Stats installed" = "Phiên bản Stats mới nhất đã được cài đặt";
"Downloading..." = "Đang tải xuống...";
"Current version: " = "Phiên bản hiện tại: ";
"Latest version: " = "Phiên bản mới nhất: ";

// Widgets
"Color" = "Màu sắc";
"Label" = "Nhãn";
"Box" = "Hộp";
"Frame" = "Khung";
"Value" = "Giá trị";
"Colorize" = "Tô màu";
"Colorize value" = "Tô màu giá trị";
"Additional information" = "Thông tin bổ sung";
"Reverse values order" = "Đảo thứ tự giá trị";
"Base" = "Cơ sở";
"Display mode" = "Chế độ hiển thị";
"One row" = "Một hàng";
"Two rows" = "Hai hàng";
"Mini widget" = "Widget nhỏ";
"Line chart widget" = "Biểu đồ đường";
"Bar chart widget" = "Biểu đồ cột";
"Pie chart widget" = "Biểu đồ tròn";
"Network chart widget" = "Biểu đồ mạng";
"Speed widget" = "Widget tốc độ";
"Battery widget" = "Widget pin";
"Stack widget" = "Widget xếp chồng";
"Memory widget" = "Widget bộ nhớ";
"Static width" = "Chiều rộng cố định";
"Tachometer widget" = "Widget đo tốc độ";
"State widget" = "Widget trạng thái";
"Text widget" = "Bộ điều khiển văn bản"; // translategemma:4b
"Battery details widget" = "Widget hiển thị thông tin pin"; // translategemma:4b
"Show symbols" = "Hiển thị ký hiệu";
"Label widget" = "Widget nhãn";
"Number of reads in the chart" = "Số lần đọc trong biểu đồ";
"Color of download" = "Màu tải xuống";
"Color of upload" = "Màu tải lên";
"Monospaced font" = "Phông chữ đơn cách";
"Reverse order" = "Đảo ngược thứ tự";
"Chart history" = "Lịch sử biểu đồ";
"Default color" = "Màu mặc định";
"Transparent when no activity" = "Trong suốt khi không có hoạt động";
"Constant color" = "Màu cố định";

// Module Kit
"Open module settings" = "Mở cài đặt module";
"Select widget" = "Chọn widget %0";
"Open widget settings" = "Mở cài đặt widget";
"Update interval" = "Khoảng thời gian cập nhật";
"Usage history" = "Lịch sử sử dụng";
"Details" = "Chi tiết";
"Top processes" = "Các tiến trình hàng đầu";
"Pictogram" = "Biểu tượng";
"Module" = "Mô-đun"; // translategemma:4b
"Widgets" = "Widget"; // translategemma:4b
"Popup" = "Hiển thị cửa sổ"; // translategemma:4b
"Notifications" = "Thông báo";
"Merge widgets" = "Gộp các widget";
"No available widgets to configure" = "Không có widget nào để cấu hình";
"No options to configure for the popup in this module" = "Không có tùy chọn để cấu hình popup trong module này";
"Process" = "Tiến trình";
"Kill process" = "Dừng tiến trình";
"Keyboard shortcut" = "Phím tắt";
"Listening..." = "Đang lắng nghe...";

// Modules
"Number of top processes" = "Số lượng tiến trình hàng đầu";
"Update interval for top processes" = "Khoảng thời gian cập nhật cho các tiến trình hàng đầu";
"Notification level" = "Mức độ thông báo";
"Chart color" = "Màu biểu đồ";
"Main chart scaling" = "Tỷ lệ biểu đồ chính";
"Scale value" = "Giá trị tỷ lệ";
"Text widget value" = "Giá trị của widget văn bản"; // translategemma:4b

// CPU
"CPU usage" = "Sử dụng CPU";
"CPU temperature" = "Nhiệt độ CPU";
"CPU frequency" = "Tần số CPU";
"System" = "Hệ thống";
"User" = "Người dùng";
"Idle" = "Nhàn rỗi";
"Show usage per core" = "Hiển thị sử dụng theo từng nhân";
"Show hyper-threading cores" = "Hiển thị các nhân hyper-threading";
"Split the value (System/User)" = "Tách giá trị (Hệ thống/Người dùng)";
"Scheduler limit" = "Giới hạn bộ lập lịch";
"Speed limit" = "Giới hạn tốc độ";
"Average load" = "Tải trung bình";
"1 minute" = "1 phút";
"5 minutes" = "5 phút";
"15 minutes" = "15 phút";
"CPU usage threshold" = "Ngưỡng sử dụng CPU";
"CPU usage is" = "Sử dụng CPU là %0";
"Efficiency cores" = "Nhân tiết kiệm";
"Performance cores" = "Nhân hiệu năng";
"System color" = "Màu hệ thống";
"User color" = "Màu người dùng";
"Idle color" = "Màu nhàn rỗi";
"Cluster grouping" = "Nhóm cụm";
"Efficiency cores color" = "Màu nhân tiết kiệm";
"Performance cores color" = "Màu nhân hiệu năng";
"Total load" = "Tải tổng";
"System load" = "Tải hệ thống";
"User load" = "Tải người dùng";
"Efficiency cores load" = "Tải nhân tiết kiệm";
"Performance cores load" = "Tải nhân hiệu năng";
"All cores" = "Tất cả các nhân";

// GPU
"GPU to show" = "GPU hiển thị";
"Show GPU type" = "Hiển thị loại GPU";
"GPU enabled" = "GPU đã bật";
"GPU disabled" = "GPU đã tắt";
"GPU temperature" = "Nhiệt độ GPU";
"GPU utilization" = "Mức sử dụng GPU";
"Vendor" = "Nhà cung cấp";
"Model" = "Mô hình";
"Status" = "Trạng thái";
"Active" = "Hoạt động";
"Non active" = "Không hoạt động";
"Fan speed" = "Tốc độ quạt";
"Core clock" = "Xung nhịp lõi";
"Memory clock" = "Xung nhịp bộ nhớ";
"Utilization" = "Sử dụng";
"Render utilization" = "Mức sử dụng kết xuất";
"Tiler utilization" = "Mức sử dụng tiler";
"GPU usage threshold" = "Ngưỡng sử dụng GPU";
"GPU usage is" = "Sử dụng GPU là %0";

// RAM
"Memory usage" = "Sử dụng bộ nhớ";
"Memory pressure" = "Áp lực bộ nhớ";
"Total" = "Tổng";
"Used" = "Đã sử dụng";
"App" = "Ứng dụng";
"Wired" = "Có dây";
"Compressed" = "Đã nén";
"Free" = "Trống";
"Swap" = "Bộ nhớ ảo";
"Split the value (App/Wired/Compressed)" = "Tách giá trị (Ứng dụng/Có dây/Đã nén)";
"RAM utilization threshold" = "Ngưỡng sử dụng RAM";
"RAM utilization is" = "Sử dụng RAM là %0";
"App color" = "Màu ứng dụng";
"Wired color" = "Màu có dây";
"Compressed color" = "Màu đã nén";
"Free color" = "Màu trống";
"Free memory (less than)" = "Bộ nhớ trống (nhỏ hơn)";
"Swap size" = "Dung lượng bộ nhớ ảo";
"Free RAM is" = "RAM trống là %0";

// Disk
"Show removable disks" = "Hiển thị các ổ đĩa rời";
"Used disk memory" = "Đã sử dụng %0 trên tổng %1";
"Free disk memory" = "Còn trống %0 trên tổng %1";
"Disk to show" = "Ổ đĩa để hiển thị";
"Open disk" = "Mở ổ đĩa";
"Switch view" = "Chuyển đổi chế độ xem";
"Disk utilization threshold" = "Ngưỡng sử dụng ổ đĩa";
"Disk utilization is" = "Sử dụng ổ đĩa là %0";
"Read color" = "Màu đọc";
"Write color" = "Màu ghi";
"Disk usage" = "Sử dụng ổ đĩa";
"Total read" = "Tổng dữ liệu đọc";
"Total written" = "Tổng dữ liệu ghi";
"Write speed" = "Tốc độ ghi";
"Read speed" = "Tốc độ đọc";
"Drives" = "Ổ đĩa";
"SMART data" = "Dữ liệu SMART";

// Sensors
"Temperature unit" = "Đơn vị nhiệt độ";
"Celsius" = "Độ C";
"Fahrenheit" = "Độ F";
"Save the fan speed" = "Lưu tốc độ quạt";
"Fan" = "Quạt";
"HID sensors" = "Cảm biến HID";
"Synchronize fan's control" = "Đồng bộ điều khiển quạt";
"Current" = "Dòng điện";
"Energy" = "Năng lượng";
"Show unknown sensors" = "Hiển thị các cảm biến không xác định";
"Install fan helper" = "Cài đặt trợ lý quạt";
"Uninstall fan helper" = "Gỡ cài đặt trợ lý quạt";
"Fan value" = "Giá trị quạt";
"Turn off fan" = "Tắt quạt";
"You are going to turn off the fan. This is not recommended action that can damage your mac, are you sure you want to do that?" = "Bạn sắp tắt quạt. Đây là hành động không được khuyến nghị và có thể gây hư hại cho Mac của bạn. Bạn có chắc chắn muốn thực hiện không?";
"Sensor threshold" = "Ngưỡng cảm biến";
"Left fan" = "Quạt bên trái";
"Right fan" = "Quạt bên phải";
"Fastest fan" = "Quạt nhanh nhất";
"Sensor to show" = "Cảm biến hiển thị";

// Network
"Uploading" = "Đang tải lên";
"Downloading" = "Đang tải xuống";
"Public IP" = "IP công khai";
"Local IP" = "IP nội bộ";
"Interface" = "Giao diện";
"Physical address" = "Địa chỉ vật lý";
"Refresh" = "Làm mới";
"Click to copy public IP address" = "Nhấn để sao chép địa chỉ IP công khai";
"Click to copy local IP address" = "Nhấn để sao chép địa chỉ IP nội bộ";
"Click to copy wifi name" = "Nhấn để sao chép tên wifi";
"Click to copy mac address" = "Nhấn để sao chép địa chỉ mac";
"No connection" = "Không có kết nối";
"Network interface" = "Giao diện mạng";
"Total download" = "Tổng dữ liệu tải xuống";
"Total upload" = "Tổng dữ liệu tải lên";
"Reader type" = "Loại đọc";
"Interface based" = "Dựa trên giao diện";
"Processes based" = "Dựa trên tiến trình";
"Reset data usage" = "Đặt lại dữ liệu sử dụng";
"VPN mode" = "Chế độ VPN";
"Standard" = "Chuẩn";
"Security" = "Bảo mật";
"Channel" = "Kênh";
"Common scale" = "Thang đo chung";
"Autodetection" = "Tự phát hiện";
"Widget activation threshold" = "Ngưỡng kích hoạt widget";
"Internet connection" = "Kết nối internet";
"Active state color" = "Màu trạng thái hoạt động";
"Nonactive state color" = "Màu trạng thái không hoạt động";
"Connectivity host (ICMP)" = "Máy chủ kết nối (ICMP)";
"Leave empty to disable the check" = "Để trống để tắt kiểm tra";
"Connectivity history" = "Lịch sử kết nối";
"Auto-refresh public IP address" = "Tự làm mới địa chỉ IP công khai";
"Every hour" = "Mỗi giờ";
"Every 12 hours" = "Mỗi 12 giờ";
"Every 24 hours" = "Mỗi 24 giờ";
"Network activity" = "Hoạt động mạng";
"Last reset" = "Đặt lại lần cuối cách đây %0";
"Latency" = "Độ trễ";
"Upload speed" = "Tốc độ tải lên";
"Download speed" = "Tốc độ tải xuống";
"Address" = "Địa chỉ";
"WiFi network" = "Mạng WiFi";
"Local IP changed" = "IP nội bộ đã thay đổi";
"Public IP changed" = "IP công khai đã thay đổi";
"Previous IP" = "IP trước đây: %0";
"New IP" = "IP mới: %0";
"Internet connection lost" = "Mất kết nối internet";
"Internet connection established" = "Kết nối internet được thiết lập";

// Battery
"Level" = "Mức";
"Source" = "Nguồn";
"AC Power" = "Nguồn AC";
"Battery Power" = "Nguồn pin";
"Time" = "Thời gian";
"Health" = "Tình trạng";
"Amperage" = "Cường độ dòng điện";
"Voltage" = "Điện áp";
"Cycles" = "Chu kỳ";
"Temperature" = "Nhiệt độ";
"Power adapter" = "Bộ chuyển đổi nguồn";
"Power" = "Nguồn điện";
"Is charging" = "Đang sạc";
"Time to discharge" = "Thời gian sử dụng còn lại";
"Time to charge" = "Thời gian để sạc đầy";
"Calculating" = "Đang tính toán";
"Fully charged" = "Đã sạc đầy";
"Not connected" = "Chưa kết nối";
"Low level notification" = "Thông báo pin yếu";
"High level notification" = "Thông báo pin đầy";
"Low battery" = "Pin yếu";
"High battery" = "Pin đầy";
"Battery remaining" = "Còn lại %0%";
"Battery remaining to full charge" = "Còn lại %0% để sạc đầy";
"Percentage" = "Phần trăm";
"Percentage and time" = "Phần trăm và thời gian";
"Time and percentage" = "Thời gian và phần trăm";
"Time format" = "Định dạng thời gian";
"Hide additional information when full" = "Ẩn thông tin bổ sung khi pin đầy";
"Last charge" = "Lần sạc cuối";
"Capacity" = "Dung lượng";
"current / maximum / designed" = "hiện tại / tối đa / thiết kế";
"Low power mode" = "Chế độ tiết kiệm pin";
"Percentage inside the icon" = "Phần trăm hiển thị trong biểu tượng";
"Colorize battery" = "Tô màu pin";
"Charging current" = "Dòng sạc";
"Charging Voltage" = "Điện áp sạc";
"Charger state inside the battery" = "Trạng thái sạc bên trong pin";

// Bluetooth
"Battery to show" = "Hiển thị pin";
"No Bluetooth devices are available" = "Không có thiết bị Bluetooth nào khả dụng";

// Clock
"Time zone" = "Múi giờ";
"Local" = "Địa phương";
"Calendar" = "Lịch";
"Show week numbers" = "Hiển thị số thứ tự tuần"; // translategemma:4b
"Local time" = "Giờ địa phương";
"Add new clock" = "Thêm đồng hồ mới";
"Delete selected clock" = "Xóa đồng hồ đã chọn";
"Help with datetime format" = "Trợ giúp về định dạng ngày giờ";

// Colors
"Based on utilization" = "Dựa trên mức sử dụng";
"Based on pressure" = "Dựa trên áp lực";
"Based on cluster" = "Dựa trên cụm";
"System accent" = "Điểm nhấn hệ thống";
"Monochrome accent" = "Điểm nhấn đơn sắc";
"Clear" = "Xóa";
"White" = "Trắng";
"Black" = "Đen";
"Gray" = "Xám";
"Second gray" = "Xám nhạt";
"Dark gray" = "Xám đậm";
"Light gray" = "Xám sáng";
"Red" = "Đỏ";
"Second red" = "Đỏ nhạt";
"Green" = "Xanh lá";
"Second green" = "Xanh lá nhạt";
"Blue" = "Xanh dương";
"Second blue" = "Xanh dương nhạt";
"Yellow" = "Vàng";
"Second yellow" = "Vàng nhạt";
"Orange" = "Cam";
"Second orange" = "Cam nhạt";
"Purple" = "Tím";
"Second purple" = "Tím nhạt";
"Brown" = "Nâu";
"Second brown" = "Nâu nhạt";
"Cyan" = "Xanh lam";
"Magenta" = "Hồng cánh sen";
"Pink" = "Hồng";
"Teal" = "Xanh lục lam";
"Indigo" = "Chàm";
